Tekla Open API Reference for Tekla Structures 2025
View Properties
The View type exposes the following members.
Properties
Name | Description
Attributes
 The view attributes.
DisplayCoordinateSystem
 The coordinate system of the display plane. This can be used to transform global points from the model that is to be inserted in the view.
ExtremaCenter
 Gets the view extrema center.
 (Inherited from ViewBase.)
FrameOrigin
 The vector from the view origin to the frame origin.
 (Inherited from ViewBase.)
Height
 The height of the view frame in paper coordinates.
 (Inherited from ViewBase.)
IsSheet
 Gets a value indicating whether the container view is the drawing's sheet.
 (Inherited from ViewBase.)
Name
 The name of the view.
Origin
 The view origin coordinates in the sheet.
 (Inherited from ViewBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
RestrictionBox
 The axis aligned bounding box that represents the volume of the view.
ViewCoordinateSystem
 The coordinate system of the view plane.
ViewType
 The view type information.
Width
 The width of the view frame in paper coordinates.
 (Inherited from ViewBase.)
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace